---
kind: property
id: P:Autodesk.Revit.DB.CurtainGrid.Grid2Justification
source: html/06b070e5-0532-e154-68e8-49242b4192ce.htm
---
# Autodesk.Revit.DB.CurtainGrid.Grid2Justification Property

The justification for the V grid line pattern of the curtain grid.

## Syntax (C#)
```csharp
public CurtainGridAlignType Grid2Justification { get; set; }
```